In [2]:
import numpy as np 
import pandas as pd

from pandas import Series, DataFrame

In [3]:
df_dict = {
    "name": ["James", "Curry", "Iversion"],
    "age": [19, 18, 19],
    "national": ["US", "China", "US"]
}

df = DataFrame(df_dict, index=['0', '1', '2'])

In [4]:
df

       name  age national
0     James   19       US
1     Curry   18    China
2  Iversion   19       US

In [5]:
# 获取行数和列数
df.shape

(3, 3)

In [6]:
# 获取列索引
df.index.tolist()

['0', '1', '2']

In [7]:
# 获取行索引
df.columns.tolist()

['name', 'age', 'national']

In [8]:
# 获取数据类型
df.dtypesn

AttributeError: 'DataFrame' object has no attribute 'dtypesn'

In [75]:
# 获取数据维度
df.ndim

2

In [76]:
# 以二维ndarray的形式返回DataFrame的书
df.values

array([['panda', 19, 'US'],
       ['Curry', 18, 'China'],
       ['Iversion', 19, 'US']], dtype=object)

In [77]:
# 展示df的概览
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      3 non-null      object
 1   age       3 non-null      int64
 2   national  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [78]:
# 显示df的前几行
df.head(1)

    name  age national
0  panda   19       US

In [79]:
# 显示df的最后几行
df.tail(2)

       name  age national
1     Curry   18    China
2  Iversion   19       US

In [80]:
# 获取dataframe的列
df['name']

0       panda
1       Curry
2    Iversion
Name: name, dtype: object

In [81]:
# 返回多个列
df[['name', 'age']]

       name  age
0     panda   19
1     Curry   18
2  Iversion   19

In [82]:
# 获取第一行
df[0:1]

    name  age national
0  panda   19       US

In [83]:
# 获取多行
df[1:3]

       name  age national
1     Curry   18    China
2  Iversion   19       US

In [84]:
# 获取多行里面的某一列
df[1:3][['name', 'age']]

       name  age
1     Curry   18
2  Iversion   19

In [85]:
df.loc['0', 'name']

'panda'

In [86]:
df.loc['0', :]

name        panda
age            19
national       US
Name: 0, dtype: object

In [87]:
# 某一行的多列数据
df.loc['0', ['name', 'national']]

name        panda
national       US
Name: 0, dtype: object

In [88]:
# 间隔的多行多列
df.loc[['0', '2'], ['name', 'national']]

       name national
0     panda       US
2  Iversion       US

In [89]:
# 选择连续的多行和间隔的多列
df.loc['0': '2', ['name', 'national']]

       name national
0     panda       US
1     Curry    China
2  Iversion       US

In [90]:
df.iloc[0:2]

    name  age national
0  panda   19       US
1  Curry   18    China

In [91]:
df.iloc[[0,2], :]

       name  age national
0     panda   19       US
2  Iversion   19       US

In [92]:
df.iloc[1,0]

'Curry'

In [93]:
df.iloc[0, 0] = 'panda'

In [94]:
df.sort_values(by='age', ascending=True)

       name  age national
1     Curry   18    China
0     panda   19       US
2  Iversion   19       US

## dataframe 修改index, columns

In [95]:
df1 = DataFrame(np.arange(9).reshape(3, 3), index=['bj', 'sh', 'gz'], columns=['a', 'b', 'c'])

In [96]:
# 修改index
df1.index = ['Beijing', 'Shanghai', 'Guangzhou']

In [97]:
f = lambda x: f"{x}_ABC"
df1.rename(index=f, columns=f, inplace=True)

In [98]:
df1

               a_ABC  b_ABC  c_ABC
Beijing_ABC        0      1      2
Shanghai_ABC       3      4      5
Guangzhou_ABC      6      7      8

In [99]:
df3 = df1.rename(index={'bj': 'beijing'}, columns={'a': 'aa'})

In [100]:
df3

               a_ABC  b_ABC  c_ABC
Beijing_ABC        0      1      2
Shanghai_ABC       3      4      5
Guangzhou_ABC      6      7      8

In [101]:
# 指定一列为索引
result = df1.set_index('b', drop=False)
result.index.name = None
result

KeyError: "None of ['b'] are in the columns"

In [102]:
df1

               a_ABC  b_ABC  c_ABC
Beijing_ABC        0      1      2
Shanghai_ABC       3      4      5
Guangzhou_ABC      6      7      8

In [103]:
# 行转为索引
result = df1.set_axis(df1.iloc[0], axis=1, inplace=False)
result.columns.name = None
result

               0  1  2
Beijing_ABC    0  1  2
Shanghai_ABC   3  4  5
Guangzhou_ABC  6  7  8

## 添加数据

In [104]:
df1 = DataFrame([['Snow', 'm', 22], ['Tyrion', 'm', 32], ['Sansa', 'F', 19], ['Arya', 'F', 12]], columns=['name', 'gender', 'age'])

In [105]:
df1

     name gender  age
0    Snow      m   22
1  Tyrion      m   32
2   Sansa      F   19
3    Arya      F   12

In [106]:
# 在数据最后加上score一列
df1['score'] = [80, 90, 45, 22]

In [107]:
df1

     name gender  age  score
0    Snow      m   22     80
1  Tyrion      m   32     90
2   Sansa      F   19     45
3    Arya      F   12     22

In [108]:
# 固定位置插入一列
df1.insert(2, "name2", [i for i in range(4)])

In [109]:
df1

     name gender  name2  age  score
0    Snow      m      0   22     80
1  Tyrion      m      1   32     90
2   Sansa      F      2   19     45
3    Arya      F      3   12     22

In [110]:
col_name = df1.columns.to_list()

In [111]:
col_name.insert(2, 'city')

In [112]:
df1 = df1.reindex(columns=col_name)

In [113]:
df1['city'] = ['北京', '山西', '湖北', '澳门']

In [114]:
df1

     name gender city  name2  age  score
0    Snow      m   北京      0   22     80
1  Tyrion      m   山西      1   32     90
2   Sansa      F   湖北      2   19     45
3    Arya      F   澳门      3   12     22

In [115]:
# 插入一行
row = ['111', '222', '333', '444', '555', '666', '777']
df1.iloc[1] = row

ValueError: Must have equal len keys and value when setting with an iterable

In [116]:
df1

     name gender city  name2  age  score
0    Snow      m   北京      0   22     80
1  Tyrion      m   山西      1   32     90
2   Sansa      F   湖北      2   19     45
3    Arya      F   澳门      3   12     22

In [117]:
new_data = DataFrame({'name': 'lisa', 'gender': 'F', 'age': 19, 'city': '北京', 'name2': 12, 'name1': 12, 'score': 12}, index=[0])

In [118]:
df1 = df1.append(new_data, ignore_index=True)
df1

     name gender city  name2  age  score  name1
0    Snow      m   北京      0   22     80    NaN
1  Tyrion      m   山西      1   32     90    NaN
2   Sansa      F   湖北      2   19     45    NaN
3    Arya      F   澳门      3   12     22    NaN
4    lisa      F   北京     12   19     12   12.0

In [119]:
# 合并
df1 = DataFrame(np.arange(6).reshape(3, 2), columns=['four', 'five'])
df2 = DataFrame(np.arange(6).reshape(2, 3), columns=['one', 'two', 'three'])

In [120]:
print(df1)
print(df2)

four  five
0     0     1
1     2     3
2     4     5
   one  two  three
0    0    1      2
1    3    4      5

In [121]:
result = pd.concat([df2, df1], axis=1)
print(result)

one  two  three  four  five
0  0.0  1.0    2.0     0     1
1  3.0  4.0    5.0     2     3
2  NaN  NaN    NaN     4     5

In [122]:
result = pd.concat([df1, df2], axis=0, ignore_index=True)
result

   four  five  one  two  three
0   0.0   1.0  NaN  NaN    NaN
1   2.0   3.0  NaN  NaN    NaN
2   4.0   5.0  NaN  NaN    NaN
3   NaN   NaN  0.0  1.0    2.0
4   NaN   NaN  3.0  4.0    5.0

In [123]:
df2 = DataFrame(np.arange(9).reshape(3,3), columns=['one', 'two', 'three'])
df2

   one  two  three
0    0    1      2
1    3    4      5
2    6    7      8

In [124]:
df3 = df2.drop(['two'], axis=1, inplace=False)
df3

   one  three
0    0      2
1    3      5
2    6      8

In [125]:
df2

   one  two  three
0    0    1      2
1    3    4      5
2    6    7      8

## 数据处理

In [126]:
from numpy import nan as NaN

In [127]:
se = Series([4, NaN, 8, NaN, 5])

In [128]:
se

0    4.0
1    NaN
2    8.0
3    NaN
4    5.0
dtype: float64

In [129]:
se.dropna()

0    4.0
2    8.0
4    5.0
dtype: float64

In [130]:
se.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [131]:
se[se.notnull()]

0    4.0
2    8.0
4    5.0
dtype: float64

In [132]:
df1 = DataFrame([[1, 2, 3], [NaN, NaN, 2], [NaN, NaN, NaN], [8, 8, NaN]])

In [133]:
# 过滤掉含有NaN值的行
df1.dropna()

     0    1    2
0  1.0  2.0  3.0

In [134]:
# how='all' 行中所有都是NaN才过滤
df1.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  2.0
3  8.0  8.0  NaN

In [135]:
# 传入thresh=n保留至少有n个非NaN数据的行
df1.dropna(thresh=1)

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  2.0
3  8.0  8.0  NaN

In [136]:
# 填充缺失数据
df1 = DataFrame([[1, 2, 3], [NaN, NaN, 2], [NaN, NaN, NaN], [8, 8, NaN]])

In [137]:
# 填充NaN为0 inplace=True 直接替换
df1.fillna(0)

     0    1    2
0  1.0  2.0  3.0
1  0.0  0.0  2.0
2  0.0  0.0  0.0
3  8.0  8.0  0.0

In [138]:
# 通过字典填充列的值
df1.fillna({0: 10, 1: 20, 2: 30})

      0     1     2
0   1.0   2.0   3.0
1  10.0  20.0   2.0
2  10.0  20.0  30.0
3   8.0   8.0  30.0

In [139]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  2.0
2  NaN  NaN  NaN
3  8.0  8.0  NaN

In [140]:
# 填充平均值
df1.fillna(df1.mean())

     0    1    2
0  1.0  2.0  3.0
1  4.5  5.0  2.0
2  4.5  5.0  2.5
3  8.0  8.0  2.5

In [144]:
df1.iloc[:,1].fillna(5, inplace=True)

In [146]:
df2 = DataFrame(np.random.randint(0, 10, (5, 5)))

In [150]:
df2.iloc[1:4, 3] = NaN
df2.iloc[2:4, 4] = NaN

In [154]:
# 使用前面的值填充NaN, axis 控制方向
df2.fillna(method='ffill', axis=1)

     0    1    2    3    4
0  6.0  8.0  4.0  3.0  4.0
1  4.0  4.0  9.0  9.0  6.0
2  3.0  6.0  5.0  5.0  5.0
3  1.0  2.0  3.0  3.0  3.0
4  3.0  6.0  2.0  7.0  2.0

In [156]:
# 填充后面的值， limit 填充一个
df2.fillna(method='bfill', limit=1)

   0  1  2    3    4
0  6  8  4  3.0  4.0
1  4  4  9  NaN  6.0
2  3  6  5  NaN  NaN
3  1  2  3  7.0  2.0
4  3  6  2  7.0  2.0

In [158]:
df1 = DataFrame({'A': [1,1,1,2,2,3,1], 'B': list('aabbbca')})
df1

   A  B
0  1  a
1  1  a
2  1  b
3  2  b
4  2  b
5  3  c
6  1  a

In [160]:
# 判断每一行是否在之前是否出现过
df1.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [161]:
# 删除重复行
df1.drop_duplicates()

   A  B
0  1  a
2  1  b
3  2  b
5  3  c

In [163]:
# 指定列去除重复行
df1.drop_duplicates(['A'])

   A  B
0  1  a
3  2  b
5  3  c

In [165]:
# 保留重复行的最后一行, inplace: 是否直接在原数据上更改
df1.drop_duplicates(['A'], keep='last')

   A  B
4  2  b
5  3  c
6  1  a

## 数据合并

In [167]:
df3 = DataFrame({'Red': [1, 3, 5], 'Green': [5, 0, 3]}, index=list('abc'))
df4 = DataFrame({'Blue': [1, 9, 8], 'Yellow': [6, 6, 7]}, index=list("abc"))

In [168]:
print(df3)
print(df4)

Red  Green
a    1      5
b    3      0
c    5      3
   Blue  Yellow
a     1       6
b     9       6
c     8       7

In [170]:
# 简单合并。 默认是left左连接， 以左侧df3为基础
df3.join(df4, how='left')

   Red  Green  Blue  Yellow
a    1      5     1       6
b    3      0     9       6
c    5      3     8       7

In [171]:
# 右链接
df3.join(df4, how='right')

   Red  Green  Blue  Yellow
a    1      5     1       6
b    3      0     9       6
c    5      3     8       7

In [172]:
df3.join(df4, how='outer')

   Red  Green  Blue  Yellow
a    1      5     1       6
b    3      0     9       6
c    5      3     8       7

In [173]:
df5 = DataFrame({'Brown': [3, 4, 5], 'White': [1, 1, 2]}, index=list('aed'))

In [174]:
# 合并多张表
df3.join([df4, df5])

   Red  Green  Blue  Yellow  Brown  White
a  1.0    5.0   1.0     6.0    3.0    1.0
b  3.0    0.0   9.0     6.0    NaN    NaN
c  5.0    3.0   8.0     7.0    NaN    NaN

In [175]:
# 使用merge， 着重关注的是列的合并
df1 = DataFrame({'名字': list('ABCDE'), '性别': ['男', '女', '男', '男', '女'], '职称': ['副教授', '讲师', '助教', '教授', '助教']}, index=range(1001, 1006))

In [177]:
df1.columns.name = '学院老师'
df1.index.name = '编号'

In [179]:
df2 = DataFrame({'名字': list('ABDAX'), '课程': ['C++', '计算机导论', '汇编', '数据结构', '马克思原理'], '职称': ['副教授', '讲师', '教授', '副教授', '讲师']}, index=[1001, 1002, 1004, 1001, 3001])

In [183]:
df2.columns.name = '课程'
df2.index.name = '编号'

In [186]:
pd.merge(df1, df2, on='名字', suffixes=['_1', '_2'])  # 返回匹配的

  名字 性别 职称_1     课程 职称_2
0  A  男  副教授    C++  副教授
1  A  男  副教授   数据结构  副教授
2  B  女   讲师  计算机导论   讲师
3  D  男   教授     汇编   教授

In [199]:
pd.merge(df1, df2, how='outer')

  名字   性别   职称     课程
0  A    男  副教授    C++
1  A    男  副教授   数据结构
2  B    女   讲师  计算机导论
3  C    男   助教    NaN
4  D    男   教授     汇编
5  E    女   助教    NaN
6  X  NaN   讲师  马克思原理

In [200]:
# 根据多个链进行链接
pd.merge(df1, df2, on=['职称', '名字'])

  名字 性别   职称     课程
0  A  男  副教授    C++
1  A  男  副教授   数据结构
2  B  女   讲师  计算机导论
3  D  男   教授     汇编

### 拓展

In [201]:
s1 = Series([1, 2], index=list('ab'))
s2 = Series([3, 4, 5], index=list('bde'))

In [205]:
pd.concat([s1, s2])

a    1
b    2
b    3
d    4
e    5
dtype: int64

In [206]:
pd.concat([s1, s2], axis=1)

     0    1
a  1.0  NaN
b  2.0  3.0
d  NaN  4.0
e  NaN  5.0

In [209]:
print(s1)
print(s2)

a    1
b    2
dtype: int64
b    3
d    4
e    5
dtype: int64

In [214]:
pd.concat([s1, s2], axis=1, join='inner')

   0  1
b  2  3

In [215]:
# 创建层次化加索引
pd.concat([s1, s2], keys=['A', 'B'])

A  a    1
   b    2
B  b    3
   d    4
   e    5
dtype: int64

In [218]:
pd.concat([s1, s2], keys=['A', 'D'], axis=1)

     A    D
a  1.0  NaN
b  2.0  3.0
d  NaN  4.0
e  NaN  5.0

## 多层索引

In [219]:
s = Series(np.random.randint(0, 150, size=6), index=list('abcdef'))

In [223]:
s = Series(np.random.randint(0, 150, size=6), index=[['a', 'a', 'b', 'b', 'c', 'c'], ['期中', '期末', '期中', '期末', '期中', '期末']])

In [224]:
s

a  期中    141
   期末     38
b  期中    107
   期末      2
c  期中    105
   期末    101
dtype: int32